;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

(package! smart-tabs-mode)
(package! acme-theme)

(package! olivetti)

(package! mixed-pitch)

(package! stripe-buffer)

(package! org-super-agenda)

(package! evil-matchit)

(package! ebib)

(package! biblio)

(package! ox-gfm)

(package! langtool-ignore-fonts)

(package! org-appear :recipe (:host github :repo "awth13/org-appear"))

(package! evil-cleverparens)
(package! poporg)

(package! separedit)

(package! websocket)
(package! emacs-slack :recipe (:host github :repo "emacs-slack/emacs-slack"))

(package! pr-review)

(package! eglot-x :recipe (:host github :repo "nemethf/eglot-x"))

(package! ef-themes)

(package! consult-gh :recipe (:host github :repo "armindarvish/consult-gh"))
(package! consult-gh-with-pr-review :recipe (:host github :repo "armindarvish/consult-gh"))
(package! consult-gh-forge :recipe (:host github :repo "armindarvish/consult-gh"))

(package! flyover :recipe (:host github :repo "konrad1977/flyover"))

(package! web-server)
(package! tidal)
(package! flycheck-inline)

(package! mpdel)

(package! shell-maker)
(package! acp)
(package! agent-shell)

(package! denote)
(package! denote-org)


(package! org-ql)
(package! org-timeblock)

(package! khalel)
(package! org-wild-notifier)
